[DIALOG_102]
BUTTON_1002=Firmware
BUTTON_1004=Demo
BUTTON_1005=Create
BUTTON_1011=Restore
BUTTON_1013=Upgrade Firmware
BUTTON_1014=PCBA Test
BUTTON_1016=SD Boot
BUTTON_1017=Restore
DIALOG_TITLE=Rockchip Create Upgrade Disk Tool 
LABEL_1006=First:Choose removable disk
LABEL_1012=Second:Choose function mode
LABEL_1007=Third:Choose firmware
LABEL_1008=Fourth:Choose demo(Option)
LABEL_1009=
LABEL_1010=
LABEL_1015=

[Prompt]
IDS_BROWSE_DEMO_TITLE=Demo Select
ERROR_ACTION_RUN=Action is running now,please exit later!
INFO_CREATEDISK_CONFIRM=Creating upgrade disk ,Data will lose in the disk,yes or no?
INFO_RESTOREDISK_CONFIRM=Restoring disk ,Data will lose in the disk,yes or no?
ERROR_BOOT_NO_EXIST=SDBoot.bin is not existed!
ERROR_BOOTCONFIG_NO_EXIST=sd_boot_config.config is not existed!
ERROR_IMAGE_NO_EXIST=Firmware is not existed!
ERROR_IMAGE_OPEN_FAIL=Opening firmware faileds!
ERROR_DISK_NO_FOUND=No disks are available for creating upgrade disk!
ERROR_DISK_NO_SELECT=No selected disk!
ERROR_DISK_CREATE_FAIL=Creating object of disk failed!
ERROR_DISK_OPEN_FAIL=Open object of disk failed!
ERROR_NO_REMOVABLE_DISK=Selected disk is not removable disk!
INFO_EJECT_MEDIA=Start to eject media...
ERROR_EJECT_MEDIA_FAIL=Ejecting media failed!
INFO_SET_MBR=Start to write MBR...
ERROR_SET_MBR_FAIL=Writing MBR failed!
INFO_WRITE_LOADER=Start to write Loader...
ERROR_WRITE_LOADER_FAIL=Writing Loader failed!
INFO_WRITE_PARAMETER=Start to write Parameter...
ERROR_WRITE_PARAMETER_FAIL=Writing Parameter failed!
INFO_WRITE_RECOVERY=Start to write Recovery...
ERROR_WRITE_RECOVERY_FAIL=Writing Recovery failed!
INFO_LOAD_MEDIA=Start to load media...
ERROR_LOAD_MEDIA_FAIL=Loading media failed!
INFO_FORMAT_USER=Start to format user disk...
ERROR_GET_USERDISK_FAIL=Finding user disk failed!
ERROR_USERDISK_NOFOUND=User disk is not existed!
ERROR_FORMAT_USERDISK_FAIL=Formatting user disk failed!
INFO_COPY_FIRMWARE_DEMO=Start Copy Firmware and Demo to user disk...
ERROR_COPY_FIRMWARE_DEMO_FAIL=Copying firmware and demo to user disk failed!
INFO_CREATEUPGRADEDISK_OK=Creating upgrade disk ok.
INFO_RESTORE_MBR=Start to restore MBR...
ERROR_RESTORE_MBR_FAIL=Restoring MBR failed!
INFO_RESTOREUPGRADEDISK_OK=Restoring disk ok.
ERROR_INITIALIZE_FAIL=Stopping to run the action,because of failure of initialization!
INFO_COPY_FIRMWARE=Start Copy Firmware to user disk...
ERROR_COPY_FIRMWARE_FAIL=Copying firmware to user disk failed!
INFO_COPY_DEMO=Start Copy Demo to user disk...
ERROR_COPY_DEMO_FAIL=Copying demo to user disk failed!
INFO_WRITE_IMAGEITEM=Writing %s...
ERROR_WRITE_IMAGEITEM_FAIL=Writing %s failed!
INFO_WRITE_IMAGE=Start to write firmware...
ERROR_WRITE_IMAGE_FAIL=Writing firmware failed!
ERROR_LOCK_VOLUME_FAIL=Locking disk failed!
ERROR_DISMOUNT_VOLUME_FAIL=Dismount disk failed!
ERROR_WRITE_UPDATEINFO_FAIL=Writing meta of restore failed!